import sqlite3

class DBManager:
    def __init__(self):
        self.conn = sqlite3.connect('users.db')
        self.cursor = self.conn.cursor()

    def __del__(self):
        self.cursor.close()
        self.conn.close()
    def add_user(self, username, password):
        try:
            self.cursor.execute("INSERT INTO users(username, password) VALUES(?, ?)", (username, password))
            self.cursor.execute("SELECT id FROM users WHERE username = ?", (username,))
            id_tuple = self.cursor.fetchone()

            # Extract the actual id from the tuple
            id = id_tuple[0]

            self.cursor.execute("INSERT INTO stats VALUES(?, ?, ?)", (id, 0, 0))
            self.conn.commit()
            print("Қолданушы тіркелді")
            return "Қолданушы тіркелді"
        except Exception as e:
            print(e)

    def update_stat(self, id, wm_rating, score):
        try:
            res = self.cursor.execute("SELECT wm_rating, score FROM stats WHERE id = ?", ((id,)))

            old_wm_rating, old_score = res.fetchone()
            if old_wm_rating is None or old_score is None:
                print("Колданушы табылмады")
                return "Қолданушы табылмады"
            else:
                print("this works")
                new_wm_rating = max(wm_rating, old_wm_rating)
                new_score = score + old_score

                self.cursor.execute(
                    "UPDATE stats SET wm_rating = ?, score = ? WHERE id = ?",
                    (new_wm_rating, new_score, id)
                )
                self.conn.commit()
                print("Көрсеткіштер жаңартылды")
                return "Көрсеткіштер жаңартылды"

        except Exception as e:
            print(e)
            return f"Error occured, {e}"

    def login_check(self, username, password):
        self.cursor.execute("SELECT id FROM users WHERE username = ? AND password = ?", (username, password))
        user = self.cursor.fetchone()  # fetchone() returns None if no result is found

        if user is None:
            print("Колданушы табылмады")
            return "Кұпиясөз немесе қолданушы аты дұрыс емес"
        else:
            print("Колданушы табылды")
            return "Тіркелу орындалды"
    def receive_stats(self, id):
        self.cursor.execute("SELECT wm_rating, score FROM stats WHERE id = ?", (id,))
        result = self.cursor.fetchone()

        # Check if result is None (no user found)
        if result is None:
            print("Колданушы табылмады")
            return "Id дұрыс емес"
        else:
            # Unpack wm_rating and score from the result tuple
            wm_rating, score = result
            print("Колданушы табылды")
            return wm_rating, score
    def get_id(self, username):
        self.cursor.execute("SELECT id FROM users WHERE username = ?", (username,))
        result = self.cursor.fetchone()

        if result is None:
            print("Колданушы табылмады")
            return None
        else:
            print("Колданушы табылды")
            return result[0]

    # add leader board

# Үш күндік жолдың бүгінгі, соңғы күніне шәкірт бала барын салды.
#
# Қорықтан күн шыға атқа мінейік деп асық-қанды. Бұны қаладан алып қайтқалы барған ағайыны Байтасты да таң атар-атпастан өзі оятып тұрғызып еді.
#
# Күнұзын аттан да түспей, өзге жүргіншілерден оқ бойы алда отырған. Кей-кейде өзіне таныс Көкүйрім мен Буратиген, Тақырбұлақ сияқты қоныс-құдықтардың тұс-тұсына келгенде бала оқшау шығып, астындағы жарау құла бестісін ағызып-ағызып та алады.
#
# Арттағылар - Байтас пен жорға Жұмабай:
#
# – Мына баланың ауылға асығуын-ай!
#
# – Сорлы бала қыстай іш-құста болып қалған-ау, - деседі. Шәкірт бала ұзап кеткенде бұлар да еріксіз желе шоқырақтап шауып отырып қуып жетеді. Жорға Жұмабайдың тақымында қара шоқпары бар. Байтастың да аяғының басына ілген ұзын қайың сойылы бар-ды. Тақырбұлақ тұсына келгенде Байтастар баланы жеке шабудан тежеп:
#
# – Енді бізден ұзап кетпе! Анау Есембайдың жырасын білесің ғой!.. Ұры жатады...- деді.
#
# – Сені мен бізді манадан көріп отыр! «Қоқырақтап жалғыз шабатын неме екен, түсіріп атын әпкел өзінің!» - дейді де, сені төбеден бір-ақ нұқып, мына бәйге бестіңді алады да кете барады, - деді Жұмабай да.
#
# – Е, сендер ше? Сендер беріп жібересіңдер ме?
#
# – Ойбай, бізде не қауқар бар? Біз екеу-ақ...
#
# – Олар самсаған сары қол. Бұл Есембайда ұдайы жау жатады. Тек бізді өзіміздің елдің адамы деп аман қалдырмаса, жер жаман, - деп Жұмабай шошыта сөйлегісі келеді.
#
# Баланың қытығына тиетіні осы жері.
#
# – Әйтеуір сендерден дәрмен жоқ екен, ендеше бірге жүрдім не, жеке жүрдім не? Ал кеттім! - деп, соқтырта жөнелді. Бұл - Тақырбұлақтан өте бергенде бастағаны еді.
#
# Содан жаңағы қауіпті деген Есембайға жеткенше, артына бірде-бір қараған жоқ. Көз ұшына кетіп ұзап алып, ылғи жапа-жалғыз шауып отырған.
#
# Жолдың бұл тұстары ылғи белес-белес болатын. Осы қазіргідей боп жұрт Шыңғысқа, жайлауға қарай көшкен-де елсіз боп қалатын жер. Алыстан жолды бағып отыратын тұрғылары бар. Тақ иек артпадан, өкпе тұстан жүргіншіге жауды қоян-қолтық, құшақтастыра түсіретін ұры сай, жасырын жыралары да бар.
#
# Бұдан бұрынғы екі күндік жолда үлкендер жылдам жүрмей, баланың шыдамын әбден тауысқан-ды. Ол сондықтан, бүгін ауылға жететін күні үлкендерді еріксіз қатты жүргізудің айласын тапқанына дән ырза. Күні бойы осылай етуге байлаған.
#
# – Бала деген қорқар болар еді. Ес бар ма өзіңде, пәруардігер, - деп Байтас бабын таба алмай басын шайқайды.
#
# Жұмабай әбден болмаған соң:
#
# – Қап, мынаның баласы!.. «Мен бөрінің бөлтірігімін» деп келеді-ау! Қой, не де болса қалмайық енді. Байтас, жүр! - деп шаба жөнелді. Екеуі де жарыса бастады.
#
# Байтастың мінгені Құнанбайдың қара жал бурыл аты, дәмелі бәйге аттың бірі еді. Жұмабайдың астындағы да сол Құнанбайдікі - Найманкөк деген үлкен ақкөк ат болатын. Екеуі жарыса жөнелгенде, амалсыз егеске түсіп, «мен озам, мен озаммен» тепкілесіп, созыла берді. Бір белден асып екінші белдің өріне қарай тоқтамай жарысып келе жатты. Осы өрде бурыл ат есік пен төрдей алға түсе беріп еді. Белге шығып алып шауып келе жатып қарағанда, бала көрінбеді.
#
# Бұлар тағы да сілтесе бермек болды. Сөйтіп, осы белдің ойына қарай құлай бергенде, жорға Жұмабай арт жағынан, сол иығы тұсынан тасырлатып кеп қосылған бір дүсірді есітті. Дәл Есембай биігінің тұсы. Және дәл Есембай жырасының өзі екен.
#
# – Әй, кәпір, содан қосылған жау болды-ау. Баланы алып, бізді баққан екен-ау! - деп ақкөк атты тепкілей берді. Артына қорқақтай қарап, шала бұрылып, көз қиығын тастап көрді.
#
# – Мас көзіңді, мас! - деп, әзірейілдей төніп келе жатқан бірдеме. Атын да, кісісін де болжай алмады. Әдейі танытпайын деп, бет-аузын таңып алыпты. Бұл өңірдегі күндіз шабатын ұрының әдеті. Байтаста үн жоқ, өз бетімен зымғап барады. Қолды болса болатын жорға Жұмабай.
#
# Енді не де болса жанды қармайын деп, тақымындағы шоқпарына жабысты.
#
# Соны суыра беріп:
#
# «Әй, анау да көк желкеден ұрады-ау!» - деп жасқаншақтап келе жатыр еді.
#
# Қуғыншы ойлағандай-ақ шоқпарды жөндеп суыртпады. Тақымынан толық шығарып алғанша бастырмалатып кеп, Жұмабайдың қалың қара тымағын көзіне қарай баса кигізіп жіберіп, сол сәтте шоқпарға жармасты. Жұмабайдың басын көтеріп, тымағын түзеуге мұршасы келмеді. Тартысуға да қорғаншақ, шабуға да мүгедек болып қалды. Сүйткенше, жырынды жау мұның жаңағыдай сасқалаңымен пайдаланып, шоқпарды да тартып алды.
#
# Енді, ақ боз ат та бірдемеге тіреліп тоқтағандай. Жұмабай зорға дегенде бойын түзеп ап, жаңа ғана тымағын кейін қайырып қап еді.
#
# Қараса, бұның шоқпарын тартып ап, ақ боз аттың алдынан көлденең шығып, қазір шек сілесі қатып, үнсіз күліп тұрған бағанағы шәкірт бала. Өзі айтқан «Құнанбайдың бөлтірігі» - Абай екен.
#
# Баладан қорыққанына Жұмабай ұялды да, ыза болды.
#
# – Өй, балам-ау, мына жер - жау жатағы. Бұл ұрының ойнағына кеп алып, жаман ырым бастағаның не қылғаның? - деді.
#
# Байтас та күлген бойында қайта оралып келеді екен.
#
# Абай өзінен үлкен кісінің қорыққанына қатты ырза еді. Жұмабайдың неге ашуланғанын ұғып тұр. Қоңыр жүзі қызарып, төмен қарап қысыла күле беріп, бөркін айналдыра бастады. Кәдімгі «жолбасар» ұрыларша шапан-бөркін айналдырып киіп, мұрны мен аузын қызыл орамалмен таңып алып, Жұмабайды қуғанда тағы сол ұрыларша, «даусымды танытпаймын» деп, мыңқылдап сөйлеп бұйрық берген. Байтас қорықса, қорықпаса да сыр алдырған жоқ Сондықтан, Жұмабайдың ашуын алыстан танып, мәз болып күліп келе жатып:
#
# – Құла бестінің төбелін де жоқ қыпты, қарай гөр өзін! - деді.
#
# Жұмабай да жаңа байқады. Бала бестінің төбелін саз балшықпен баттастырып тұрып сылап қойыпты. Жұмабай кісілікті кісі. О да күлкі бола бергісі келмейді. Енді бұ да уақиғаны ойынға айналдырғысы кеп, мысқылдап:
#
# – Өй, ұқсамасаң тумағыр! «Ұры Тобықты, ұры Тобықты!» деп Керей, Уақ зар қағады. Қаршадай баласына шейін ұры болудың жөнін жете біліп тұр. Зар қақпай қайтсін Керей, Уақ!.. - деп өзі де күлді.
#
# Жұмабайдың қалаға бұ жолы не жұмыспен барғанын Абай дәлді білмейді.
#
# Бірақ, оның Байтасқа айтқан бір сөзінде Құнанбай тапсырған бір жұмыспен барып келе жатқаны мәлім боп еді. Абайдың бұрыннан байқауынша, бұл Құнанбайға қадірі бар кісі. Абайға ашуланып, ренжіп барса, алдымен әкесіне шағады.
#
# Осыны еске алып кеп, Абай енді күлкіден тыйылып, жаңа қатарласқанда:
#
# – Жол ұзақ. Ұйқы ашар болсын деп ойнап ем, ғайыпқа бұйырмаңыз, Жұмеке! - деді. Енді тіпті сыпайы. Сызылып тұр.
#
# Жұмабай жас баланың пішініне ырза болып қарады да, үндемеді. Байтас Абайды құрбысындай қағытып:
#
# – Жарайсың, «ғайыпқа бұйырмаңыз». Сенің мынауың, менің: «Көшкенде жүк артамын сары атанға, айтамын не бетімді Ойке апама?!» деген өлеңім сияқты болды-ау! - деді.
#
# Абай жете түсіне алмады.
#
# – Қалай дейсің, Байтас аға? Ойке апа деп кімді айтасың?
#
# – Е, Ойке апаны білмеушімең? О несі екен?!
#
# – Бәсе...
#
# – Бәсе, Ойке апа деген біздің қатын. Былтыр ала жаздай серілік құрып, ел қыдырып, қыз-келіншекпен сауық-сайран салмадым ба? Содан, аяғы қызық бітіп, үйге қайтатын да мезгіл жетті. Енді қатынға қалай қарарға да, не деп барарға да бет жоқ. Сонда әдейі бетінің зәрі қайта берсін деп, «Не бетімді айтамын Ойке апама...» деген өлеңімді өзім ауылға бармастан бір-екі күн бұрын айтқызып, жолдастарымды жіберіп жатып ем. Сол осы күні мәтел боп кетіпті, -деді.
#
# Абай да, Жұмабай да қызығып тыңдасты. Өзі сері, әнші, сұлу Байтасқа екеуі де - бірі кәрі, бірі жас бала - қызғана да, тамашалай да қараған еді.
#
# Абайдың көз алдына Ойке деген жеңгесі де, Байтастың былтыр жаздағы әншіл, сауықшыл жолдастары да толық елестеді. Естіген әңгімесінің бәрін еңсесімен ынтыға тыңдайтын бала бұрын Байтаспен сырлас, әңгімелес болмаса да, жаңағының аяғы немен тынғанын білгісі кеп, қызығып келе жатты. Байтастың құрбыдай қалжыңдағанын пайдаланып:
#
# – Ал, Ойке апаңа не бетіңді айттың сонымен, Байтас аға?.. - деп жабыса түсті.
#
# Байтас бұған күліп, енді іріленіп қарап:
#
# – Не бетімді айтушы ем? Сорлы қатын алыстан әнмен арыз айтып жатқанға шыдасын ба? Келсем, алдымнан өзі шығып, атымды байлап жатыр, - деп, Жұмабай жаққа қарап, иек қағып қойды.
#
# Абай үндеген жоқ. Ішінен «алдаған екен ғой» деп байлады.
#
# Сол әңгіме жүргіншілердің таңертеңнен бергі қатты жүрісін Найманкөктің ақырын бүлкегіне әкеп салған еді.
#
# Шәкірт бала ауылға асыққан, лепірген күйіне қайта келіп, тағы да тебіне жөнелді.